{
  "artifactVersion": "machiner-base-model-v1",
  "baseModel": {
    "artifactId": "melee-base-v3",
    "combatClass": "melee",
    "version": 3,
    "architectureVersion": "melee-heads-v3",
    "featureSchemaVersion": "duel-combat-features-v3",
    "actionSchemaVersion": "melee-discrete-actions-v2",
    "approvalStatus": "approved",
    "approvedAt": "2026-06-24T02:39:41.358Z"
  },
  "training": {
    "recipe": {
      "type": "synthetic-supervised-mechanics",
      "sampleCount": 6000,
      "epochs": 18,
      "batchSize": 128,
      "trainedHeads": [
        "rotation",
        "swing"
      ],
      "neutralHeads": [
        "movement",
        "block"
      ],
      "upgradedFromArtifactId": "melee-base-v2",
      "movementHead": "nine-action-softmax",
      "movementActionOrder": [
        "stop",
        "right",
        "left",
        "down",
        "up",
        "down-right",
        "up-right",
        "down-left",
        "up-left"
      ],
      "inputContract": "seven-player-plus-six-opponent-features",
      "inputCount": 13
    },
    "metrics": {
      "finalLoss": 0.2596965149044991,
      "rotationMeanAbsoluteError": 0.1449869126732139,
      "swingAccuracy": 0.9288888888888889,
      "validationSamples": 900
    }
  },
  "integrity": {
    "algorithm": "SHA-256",
    "digest": "sha256:394b8f832b0aedf56cecc0203a15e89aa28d055472e8beece098c56245aef500"
  },
  "model": {
    "modelTopology": {
      "class_name": "Model",
      "config": {
        "name": "melee_combat_model",
        "layers": [
          {
            "name": "combat_state",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                13
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "combat_state"
            },
            "inbound_nodes": []
          },
          {
            "name": "hidden1",
            "class_name": "Dense",
            "config": {
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "hidden1",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "combat_state",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "hidden2",
            "class_name": "Dense",
            "config": {
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "hidden2",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "hidden1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "movement",
            "class_name": "Dense",
            "config": {
              "units": 9,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "movement",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "hidden2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "rotation",
            "class_name": "Dense",
            "config": {
              "units": 1,
              "activation": "tanh",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "rotation",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "hidden2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "swing",
            "class_name": "Dense",
            "config": {
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "swing",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "hidden2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block",
            "class_name": "Dense",
            "config": {
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "block",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "hidden2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "combat_state",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "movement",
            0,
            0
          ],
          [
            "rotation",
            0,
            0
          ],
          [
            "swing",
            0,
            0
          ],
          [
            "block",
            0,
            0
          ]
        ]
      },
      "keras_version": "tfjs-layers 4.22.0",
      "backend": "tensor_flow.js"
    },
    "weightSpecs": [
      {
        "name": "hidden1/kernel",
        "shape": [
          13,
          64
        ],
        "dtype": "float32"
      },
      {
        "name": "hidden1/bias",
        "shape": [
          64
        ],
        "dtype": "float32"
      },
      {
        "name": "hidden2/kernel",
        "shape": [
          64,
          32
        ],
        "dtype": "float32"
      },
      {
        "name": "hidden2/bias",
        "shape": [
          32
        ],
        "dtype": "float32"
      },
      {
        "name": "movement/kernel",
        "shape": [
          32,
          9
        ],
        "dtype": "float32"
      },
      {
        "name": "movement/bias",
        "shape": [
          9
        ],
        "dtype": "float32"
      },
      {
        "name": "rotation/kernel",
        "shape": [
          32,
          1
        ],
        "dtype": "float32"
      },
      {
        "name": "rotation/bias",
        "shape": [
          1
        ],
        "dtype": "float32"
      },
      {
        "name": "swing/kernel",
        "shape": [
          32,
          1
        ],
        "dtype": "float32"
      },
      {
        "name": "swing/bias",
        "shape": [
          1
        ],
        "dtype": "float32"
      },
      {
        "name": "block/kernel",
        "shape": [
          32,
          1
        ],
        "dtype": "float32"
      },
      {
        "name": "block/bias",
        "shape": [
          1
        ],
        "dtype": "float32"
      }
    ],
    "weightDataBase64": "9+YFO9IqdTxJwKU+yPsOvZG6sL0QqHA++oiiPuk4Uj6BvA8+tnYava6oo74vigu+YzCkvWgeHT2q5Q09P4uUvfO2Gz2PZNi84h8gPiPrFT5+i/w9YFR6PSvsB76GazU+po/9vWCAGD7rPoM9PKakPVn4sTvh/vK8POFrPcSsBz3E1YG8tRFkvfxmpD2mSyu7hVSNPY3o5r14cvy94RXIvQQvuz1iSWg9wvwwvcPttb3fZD++Qr91veKZBz4Fe6i9PkJRPUStEz4u11W+b34IPYYMk77+PtI893uHviAumr1suEU+u6mFvQTfrz5YYdM9mEYIvt5AE75hX1S+yWs3Pq7aLj6Hri69vIc+PgwWGDvY+sA++e4YvbKfYT7nl4q9edvSPuC807xuHrY9iYkGvmEEpL7yAFe+jlYOPo2V/Tw/KSA98rybvq8xPz54Vso9sb1hvAuUH77F2PQ9txdvvFcSSr5tmA0+zEttPkovfb0vd2y+2ypvvl/ZJ767Ips9lOV/vSarnTuvopG+4xokvQtG+b2HBlE95plyviJTB71Uq6U+bONdPkeBt72Pti6+g9LsvR+ioTrt7KI9Q7+ZvTZeUz2t4A4+z2AuPpbGcD41ez0+lB/pPd24Vz6zE0K+ahTgvYMfAj6LG+i9aMlCPu67TL1TkIm8h8oZPfZanD7WBl49b1O6vAbjNb2e3oC9SjhmvJhN5z5PW6S88DGMPQ1x9bxemY68N3XRuz4YLL6//2o+wiUzPibUjj4G42W9rIgrPPZBtj3jt0s9c1H3PYFEvT4yhhO+HQjYvYxGvDnlu9I+Ly+HvfZtGz5IPBI+XfvEPsSpID6Szc8+33d2Pv0/8z1PgWg+nzUBPqwIE76i7qQ+l3ONvSZ9yTyhGpm9pLkkvp9Fkz4g3wG+RhuuPt3U8LzON5s+Vb6qvlJJjD5PQS6+/hvYvUHcnD69q4W+jsDgvTgLZT4YOye+iXbSuydVlT4j47k84ZmvPuqsGT7bz3E99nx2vZEMVL5Lsxe+so2TO7z6ND42Og8+PfPVPZ0JID5mA649N3AFvv5idz7SmiG9fHJMPshwk77TuGa9iNcLPgl/q73Qspw9rl6pPSaj7TvcrbI8ZIwBvtWCIb7T3me+sxVnviKkrz0G56W9ijPVPRAmcDySnya9ac8CPhalNT4TE4c+gwlzvYy/Vr4rqgw96AWVPdIv+Lxdwqq8dH6mPiNRpr5YBu89nGWDvjbGYr4aLl8+B1DzPZE02z0Fw4E+1817PlnvDb56n1O+kZzZPc3wLzyMMMw9hdcQPjQSZ7oa5yU+5BW+PRAU0T3ZtYQ+wbqcPBrojT6M0Jm+iAnxPI72Hz4a1m06Uh4LPZWPAj2wtby95YzXPYViGL3FsTc+s++avjICq7wi5xC+HuZbPeCbvr0rQ4+8n6+GvOMLKj5Wq26+1D7SvVxIs7tpqSs+jIdbvDBX4T2QfoE+vlc0Pv42Aj34ZR4+JQWMPXt1ob5NCKa7b6uuPeVeHD1HE5m9s3fWPDjBFD5nPTM99ZXevAczbz5DK7e7cP3OvboVG76kpZo9WXMsvvicl731K2Q+VWFhvuHfiL7xaKM+6Sk4u49YoDzy0Eo+eKtIvs3KHD5NLD89FqULvrAuJ77xpq29yN+JPUJKSzwqNgk+hIG+PE7/gL1ytb28R/VtvrUesjxGc7i9QIiFPV3YkT1t1Sm+I9cIPnsXZz5jZ1w+AVIKvkQFjbseaWa9mDJavrXuCr4VQDC+K+1Nvllh370bP8w9TuroPH6KCz49nNO9lWyCvNWEPr4Ce9W9BySIPQ8OQj3C2Vk+cA8JPZucnr6slR4+e06MPY+aGT3VVkS+Yd8cPgx5Rz5X/ow+6XvDPdVl0T29tdI9YUn4vMfrrr5dna6+cGgmvk8/Tb7EqqW9MhYePjZE2TxifQ8+xbU2PJz2lj4HL749q9ifPke0T75eXKI9m+VIvRumEj4y3Is9X3hqvlUzXL7lOd49GsJwPoz48bxuovQ9MKaRPLWVlr0JGic+bAMMPRP7gL4QMRo+UXidvu8f8Tw9MF2+T8gzPJHAPj7TkBW+VRXSvZlpAD4ATWq+q0WKPkf3Qb3Lfpm8Ea6GvsCTSTxHPSK9UmoTvnMxzb0JzC4+QEhQvVk8RT4X6Ui8AjFrveNmfz75zs08VIaPvAQoBb5UNjY9bwz2vSz7Yz5ff+Y9qyMQvleM1D3JE2i+R7oavjb3LTyfoxu+PZOrPcItkj3M6/S9YZO1vesBWT5PBMY8ouUXvp5yLj5qWJg8U5WAPlFGOr60rzg9gNRFPnnAKr5nHo6+FamIPSlmlr1a3fO8QemzvNb+zz0Cs9Q9Pd3uPEiRR73bvD691Ehevo7+Sb4l6dw9m/3NPZIYBr3j6QM9nYyzPiVNMD1ahXG+deWXPZ843b16SbI80e2KPtB7YDxl5fo9kM26PTC+kDxLe9s9zAcgPaxsiL4rgZo+JGeBvZo5kT2CY2u+QbS2vsROUz29g9E9USuePAslwj3GmOI8WBjIPSMjOb50B5G7B4TCvYlryD2qRwG+zwAVvlg5Yj2aySa+G96Ku9ofjr0c0JK8bji2vd0Dg73ifoG+uBoUvugFIj4uTYC+202OPSfMM77QmEA8AsfsvOe1yD0I4bQ+HCUcvSvUb74pQQu8x4o0u2ROFrybVLO+4lWEPbbhhj4G7F094puavo8uhj58S56+P8XJvQgN1jwCzGK+ouikOozyIL1m9zW+CoBbvpGbS73GnMm86oh8Pt4Z1j0wMzq+W3SJvvTk2b2R5H4+6jVvPcNpoT3DhT8+LSMXvURxEL4qaPA86f79vXseAj2LKwE93nJ5PjqIfr3pPvW+xyJ6PrS4t70Fslc+99N3vnE0a7yAH48+V6MXPrDyuj28A8g9ZYT0PouM+b3othE/mkUuvtK5wD1N9b491NP4vJi6A74vswU+HSLHvmYRQT7ZeqW8Sw8pvlMjUTwtqzS9kugVPvxoAD7AjXu+ko5DvgiRwL51PIe+worcvb27/r0gERy+/eL7PTuYIz6Wna6+T2bkvLljiT7HnCs8LMmqPngvJj5jcXG++d1Jvk91mz724qg+4UL/O1t+Dz4MnO8+jX5ivU9CfL7s9rk9GdLiO6NZNL+hJvs89iyWPii9KD5kJga+F2WDvq06Sj4jb0C/vwATPrl6Az4bXn4+3qA2vlrLm766CqA+nTr+PhnbEL5+mgA/CcD6vsg/Qb4Dapa9RBD1vlyBHz/5hio/KysCP+aalD2WOBU+wt7BPeLvr74nop2+cpMBv1G6hj5CZAq+M9g2PfRS0T7qMmW+fxG7Pkyjpz5R1QK+d5fOvuOx+LziTrM9aA23Pbk8BT9nYkI9vR/evkl1m7xCasu+REG/vCdFz77+1gQ/FKgAPslcNTzAyYg+PY2nPLS3mD0L36M+oTDlPa5O6j3ww8+8gZS/vH77bL78RWO+8pirvkCOMzweX3s9EapKvhR9sT5lmEM9YV1MPgPjaj5xb1c91EQlPeUGor7Quxm++aBbPimY+zwcWfo95tyfPgxtDL4gyqY+6nwlufhPVz3e4ZG+nraXviSRzr0bYwQ+lnGrvaL4uL0Y3C+8tL7RPWTBMT26KDe+kEMlPnHmkD0YXsc9pHVmPrecDb7RRSo9rOB2vvgVKz55WsK+DCUrPQah5rsp9Ce9aHyHPrkoeD4uqvM9kQCTPW+D5L1imo89bh2XPmf1Er6abso+ZLS3PlF+g75ZjVQ+2JVAPuaGw73jKFu+TDnXvbxKQzxAxpo+YQmyPVGXQL60iJ2+Ji9kPoi3ZD4Qgxs9dcumPvfZ0D3TCJ08d7uSPSV1zruh8F6+0rRnPcBEmz48byG+ElCQvH9g1j2x7M0951YfPDJvxb1a/t29pN8zvgE7TD7kHiU91qqZPVoQSz22TaW8XuLsPc5Lmz70ALC+fFUdvXlqZD7h5PY9nYF1Ptn2xz1dW1w+TtlWvsbA9z2sKJw+pjVkPhXJHL5h3MW8LtFNPsCTDr43cjs9MR8vPWRd6j28BFE7VvEsPkXq/j1mXMA8DLH9vcpowL14N2c+NkE5PanX6bzUYbI+TCBBPkQkyz1MU24+uVoBPaV3BL4D+ps9Om/uPYrqiz1+T6c+CPmovSIhNL08ebW8+2dHvnViSD0aoV69lwkqPvtdoT1Aify7+OUbPrnePT2aTz69yXhpPfcOGr3mVRw+zmObuha08r2BJna+cR4FO7BuDz3bK8C9Fl5UPNhpiD4CRgA8msuTPVmm+zs9ago9/2E5vNBWNL7tWh28uLeoPDTUfT5vKEw+pawZPty3jz0KlC2+Ia6bPk6azD2sAns+LYqzPewTljo/zBA9ePakPXBKFL02N44+kOeOPqz/P70Jptw8Thq/uk3nij7zh509M2invSUzg73hg2S9HLJnvfKlnDwpnBY9x5zBu9bLljxABkM5OPM0PW5NDj1RLoU98KqNPUI1tDw0Hcq8hB6cvEs6ijywnZw99fc7vBAfQT191p09Q9uSvFaFIz2L3Bg92cJkPdqZuDwXRZ28kPj2PLsryz0m3UI9h5gdu1stdz1F0+s9sv9AvLto8j1gWg492M7tO/UNjjxw7d8991gfPWM3CbxWHji8GHRsPQIpPr3CSoQ9GC+YPRXlO70c3RM9izq7O0hrdDz9Gi09FK1gPLtFFj2NxPE9qQzpO4zqlbz4Gji9Co0GvcOSRT146si6BqE7PY6DRDjVpSY9dQSlu5emLbwZYag8aw6FPGfjUD3zPww90ThTPhyB4j0GOVQ7KOjLvYF+pjuxPo09eEbCvApQTT6hzIQ+yn5qvh+aIj7ML0W+eN2VPi464T0Y9vQ81uulPXOygb59lQS+bzqzPKkl0z3nx5M9ipgCvvijrL3rdHs96mF9PnE1wj2t4IS+5F1nPeK52r5jTmg9kmNDPsUNiTz0/XM+8GF/PREXDr7cdzi+LVmFPUu4Vr76ihG8VSqePQf+br0rpY29nR7pPYtbVb5TKoU9SQ70PI7lEz4htSy+8M3ePQXuc7xDujk9p/2qvhoxsj7jtgS+asuOPe3kmT5FBDk9PscHvVUClzys3f09Uu+1vbVAB77H4d4+THExvhQxoT5uotQ9eAw5vl/vqz4v9ok9pDf8vLwIJT4Rm4U90/QjPlprE76kD8q9E12Jvp4xbz0OlaQ9Zxl2vGizLT1V3JY+ZxWpPnfMvr0J5eA92gj5vb/1hL5/nKs8r2PpPIdTED7GD4S9sONDPbZnnL7lHgu7vHb0PQFmlL5x6tq9VUjSPafbAz5iXrW9cCH7PcKIRr5jtVS+XjN8OwAZEb5skbM902IXPotXaD2I9/w9fHC4vYrZy7udKAs9q33MvTUtwT5vPiY++jvcvSyygL1o4Ha++02SPpTRRbyda6o90uOFPiziOD1MfIY8DhQBPU5LvDw5yMo9GaJ9vsuf8Tvlphy9jhK8PnxQerwgyZO+6jYaPmz42D12zQs+71DXOhXhlD6kllw9qHsOPrZMML69qZI98v1FvmXeXD44sFO8FbqLPAuOGr18uoy9+mouvsepfz1yOCG+NXJsvk0bpr126z++f9TtPWi0e74tYpY9bYOCvkjofD38uCo9H18xPsuiFjykvJC+wqzNvXxi/LxGwAo+T7Hfu/bMMj0j4cw9n9E5vn8qpj1BBIo+K+RpvVFysz5BtSi9p2+2vXnagD06c5W8b+E5vUFuSD4xf3e9qmePPiu3kj5dk7895qqivHOC3LykLZs9qcj/vTeP3b0W2IO+pvMoPcrkrz5io/i9pA2lPTP6IjnLDB++tjIdvlA6arwyAsy8Rlp1PiPPBD6VmqW8JevDPm67uT1Qvuy9x6Ydvo+Tij7TJBq9yQmuvWlVKr3GoBs90reyPVqWHD4kjiO9TFAzPkj9rrxZBCW9Y6YtPsEqYT3gxjy94V+mPraAiz4fBpi+12J+O2R4Cz4fPba+3dWmPrj9nL6M7Pm9jxtTvoi0dj7FjRE+XUVUvnkWgb63fyo+D26bvegRK75BxAq+ugdXPosRtz4N+aE9/PVivaR2jr0aMXw+kNqovlUsxz3SlhQ9zVOZPk/4/D2ELCw9aEY2vfgIE75hM6e8i187PbEhlrwsjbQ+kjW5vQp+Uz6BWoY8BjCqvUI2mDwcQUW9PaypPqyr47wIYD2+oDrNPHEYKr584oA+okw8PhUAAT3uBDO8MRs5vGFEG77xGYi+wwY/Po/sfz6iBIk++9ljPgsMgr5XLdO9tZoAvemYUr4P5p2+Bz1jvpIHkD7xJJC+jSv/vInA5b0TDxc+nzFRvoM/or6eDJ89bnjEPUsogj50/4W+YKxmvnsExb20wCG+sWt1vV/WIj0jvle+STg2PT6vxD1liYs+xXw7vlrRMr6TNO09No67vTgxJL4CExS9u7qpvgEnLD7qR6Q9aAcEvfJLUr4mbYc+Gdfzvbzu571s0t4+/vSlPm01pD50+1W+xSagvMXzkb1+DD++Pi8QPbgbmD0FwYC+gKa3O1iZiL42vqi93yvCPEZmjL1UhYg+lAsSvQXA0jvqFTi+t2htvm7bvzxe41G+NyQNveQeKb5Qmp68o6W4Pete2L2vZD8+eOSMveL0nr15ROQ94Dw/PQJxrD7fhSq+UTBMvvX8jT48pSe+AWjCvOqCUb6/z+89LKIfPb4Ksz5odUI8QZBKPpRt9j04S1e+OwF3vryyfTxAGZK+T0ZNvjKmGL6fnRU+rRL3veduCT4/GYw8IDnnvppYiz7a57W+IPpuPjRhnz7WDfM9mJWBPYma+Lyg/8Q9/b5TvbABnL4IymM9dk1Evh6jDD67hki9mo9wPlD3ar1q6ko+lb1IPHGsND7adD89aJlTvhw/+r3/6CW+E5EyvRkyrT5usdo9mKFZPaPtG76zo5Q+j7CFPsXlKT7G8aW7oggIPmeqmj5hGKo9wBJSvWS2Zj5/h+e89adjvDpzmz22OE4+QVWIPmCmkz3X5wG+SNDwvlW0UT2VRY09CQlxvdAU6L2oK9g+977WPaDaO742vRS+hrx4vi9X6DyRAeG+EVBKPml/5D6QsHi+MlBGvmFXWb4zL8Q+bRAHPhjwgb5O4s8+JiH4PmvF4j7qEBY9xpzQPQtDpz0RYu6+Cs28PjcpLjvUdxg+Uu2evXaH5D21cwc9mvoxvtPhsj10r609tpVfPqY6Sb221AK+lY4kPV94i74bqRS9BruAvkzVgz5sc9S9Ti56PrQZBz7dGuy89xwBPhtjijuqKYm+TnWwPcQ6RD41/O08B95TvqJIWL0eOg2+YavevZbE2zwjHPu9y2EXPna1lb1ar+U89Q3uvWDXjT2kI5E+s9lBvMgU5D0n+j89UKNUvXMs171fr0++H8KZvMcxsz4Qx648vTjIPlERJT69pom9eQClvdXkLj7+2Zk91e56uxZYv71eMC0+gT2GvSTWbzv/KDe+QoUIPisiej7OB8c9Y2ahPmCCor4uts++RFdmPriZ2r1uCO29S+88PhULhL6jiSS9q+CwPbnc2jwEnV6+uto5PVPnS73o2p49XEiVPmurJD5AjQa8lqF0vYcQEz1QIwA/EgPdvl2jvL71ULO9uogZvbf00T6OY2q+0TJDPlc2r74LoHm+JDw/utYPaT1KcCM+3NeIupP/wj6V6qY+MXNEPtAYJr3cJZu++EAKvjZzmr0i+n89D9WUviyeDz6T7Ro+owmHvoFb2j2+RhA9TTJ6vlf5xj12/ZU+qggEvSTRSz1SoMC9UbDBvTfncz66ABS+Jso6PoheOb6R3i47JafoPdkzKjyTkkK+xemlPpLKpr09dBg+B0YDPF/5cj1wQY091I4GvLAq4T37ujQ7D/i1vmsGWr7f1WS9xOUgPkPlhL49cjs9sLgPPgvXab4Y72s9M+MpPk5zh77qYzu+GKCYvdjkdj6+SZG9l/uZvnhtyLwRGOK+3RTdPUwTNb62ZNY8ZTP5vDm6kT6iQ7k9PyJDvOoniz6h1nW9f9J9vlKLUb3evKY9wERoPdt1Rj5hJQO9CDmQPZapzr3xlJm+u9jDPaZ0aD5XCJe9nPyTvaimH76Pz5g+n0yBPYz6tT5pl+K9l/59vnknoL0j85w+3dy7vWeM/brWVn09kwG8vSTE3DzY4fq9BPzYPTemGjzytJI+9amivsyORLwrz5U+bafgPjUtMb6/RhW/UhxevktGq74jRQM+606qvZ3pEz9KcpY9BucRv5drnb5TjtS+gkRlvhBQyr4Wm5c+jhInPuZ+Lz2giQQ+AakkPveW2z6qVHU7AOGMvjyzbD7/sLU+OLScPtEZBz74/qM9tFPwPpVRAr++0jI/jmk7PR2QGj6XJgQ9JnoAPzPOmL4QhQU+Bp6zPaOYzTzrjq4+LhydPt/xS73zc0u+4dxxPvdqIr4T+yC+EcaLvj9dRj70vqm+O/wSPqmwaj4CWGg+oAHEPUJiPj7Jz92+vSWOPgY2zb6DbYU+pwBvPmHdlD56FB4+X0QBvglMLr6vDMc7DSfzvYCsIL5v90m+/P+Pvk0iqL4KHyA9hRE5vgnocDumNVY+8aU1vofWRb7AlZg+jTrHvawp0T0blVi+jtVnvi6Dlj3HWxi+ziqLPvdJWD1HvtA9VynTvcE1FL7V6t89Qjk3vtVQqb0luai9JPTpvASgyDvjQcm+aYORvuK01b3aA0A+CCCSPimH1TvEdGc+K9OMvm3//71+Hv+9x/SnO90lEz2Mv1W+kwhbPpN4gbwFe549hNCRvu5axT54UAI+D0OAPku0Pr5NkvW9oZlsPW6HXz6dcxe+8BtqPo9UG77ywJO9dRMFPT/iJ77VK4q+O6WTPJrysD3PdKG+hnnQvqZNRDwYmuA+J/ezPdraZD0KETm+A/qRPl45g773TIC8UFigPsLBFj5XQpC+TceOvvju3r58sD4+uIV3vl/m/z0+TYK9ChBOPnrdhz5vsTq+mBRSPo8Mb77gO829JRuTPiycoD4VNFY+sTXbPGN7yrzyt0A+vFMavePKpz01sdw9/STqveFzBL3bfqA+05cePlXrgr6aLgs+aYcHPvQDp75pcQG7XXdqPh0Rkz39t/U9UwievvxgC76Lj709idravcp0y7yzcDa7zp9EvTyaiT79fkk84re6vbWF6L4NYCC9BzewPVwL5b2OXCA+Ed2TPdwjjDucRjI+Si+qPodeH71i6WC+4CqRvD6iNDzb26U9jBzcvc2GzrtN/Co+o2kQvRUWFr0MPji+nuIoPsM9tL2E0YE+Re8kPtncmD7j2F+75jvCPFGSRLwQNWS9PMFavan0TD76HIe9gEiWPZyPub5jWsA9x5tavl7n4b0ZDZq9Znd3vB9Etr15RIO+REfCvtpkQj55Dhe9NYIqPXIE1z0p+YK9sFyCPQcVPDrQKl0+CINJPoR/qj06qgi+T8vVva1tij1TdyE9oSWevkSoZD00Ajk+lGUFPuYZSj5ov2K+YeFqPvoiVj07eVM+OJoiviphqD5OGls+8E2ZvlBQHT44hpu7KD7Ovgi0dr1jvXs+Z+Q1PqtrYD1aVI4+WyL1voOoUz4RZKK+EGPWvczRBL42mAs+Y9gMPnzmQb4Pnu4+ldC8PfoQJL5sAme8iG4aPudJpz2xQLi9/KavPkIxM7388i698gJUvfqYYz32Mi4+ZxYQPhs/pT4asR6+Ftl7PpVxhD49PYq+woVgPoFpCr89JIa+SBtmPjIMBL+hQ+m+JtADPig/e71WsiI+qNmPPhvxRTyx9ua7GEPQvsnKqb4UcDE+gnltvlx6Oj68Asg+lavMvLDrgr3c4ZS9wZuEvtJouz7mlqM+lsCjPpSlcz2aRW0+gt7uPVnlkb5eNXc+PWSHPbrInb7MmZW+adIyvnXo5D7I/Xw+i22SvfEtu76zUVu9e8QAPZISdL4KqGm98dPMPhmIZ76GrdC+UOWTvfEKCT6U0Gs+krkLv5de6j7+WWy9wPcuPpUMGT45XJ6+HX8WPwKChr0YMFC9neA6Pi//2T7xToI+/OZNvh6a+T6fW/Q+TvLZvpjK1D4d1eW7t72cva6dG76pzRE7rrJVPjYCO71CTUe+4ZfZPmV8Ob0uc0q9w/d0PHpRij1YaqG9T+dmvmO/Gz7Q3CA8A/aNPCibsb0VVpW+srdRPs/AVL0b7ic+8QZuvgvUbT4rUhm+rhaSPk6KND7IT7W9VzG4vfFu0j4QoIe+1JIMPlekfz4gXIA+785kPq3Y0T1S/7+9gsq+PU8jdr5ojsW9YCOtPvhiQj4gEmw9VQabvYI/ez3kmnm+HfCPPgRzpj1SCe89UteuPReHrL3556G7e+givnfwNz0yN4m+FCX/PbPiwj2+7ZK+v+TwPc6kbD2sj6s+ChIRvh3NUb75Yt4+vWUiPlj1Aj4uFjo+7PkKPj5ajz3mtCI+IWWjvb1wlT4Enby+6KPnPYfvAz7CC8y+dfsXvTVyUr0aiAQ+KlinvtzSHT4trgM8oJIFvZLNcD6+Usg9ZaVEPBwJHz1hTJo9v2NqPjA55T1GoDw+7hwdvkcHrz6gwlw+p2hbvh6erj7vX5u+DT5zPNP69j5jyio91a2RvoTJuT100DW+bkK6Pq8loT6K/rE+b4OdPRPdaL50byC/Ey1WvvV5zz1KWYS+GcXqPtv40bw53nS+9izOvbmD1b4kKJ8+G/HsPAWRLjx9tAM/Oc+4Ph/rVDpHh0c+Jf6cPoDF0z3o2t6+KAD6urH9br3m7Mg+/cksPgmZer0tSe2+ofDTvSjQrj3I4VE+UecDP2Dqiz4LD9W9g98xv4o4M7+iaKu+NWCKORgGmb7M2YI+wsUoPt6u8z1RJQ8+FWFavqn1Nb1usoy8G2CWPfzGjT5REcY9zlvPPoiQvz4Pxeg+7bPavVW/sL7uFl0+Iu0GPqK61T6VB+I+RguOvn8Tar5HuW0+iKgSPne44L3C1JY+urRaPjbb3D0CnVA97v3TvgYC+7z8leq99CBAvggQ0D4KLYI+XzlKPg9twL1r6Cs8eUEZPguiij0YK7Q+IvW7PlmbTTzdWfM+VCyivrN59T0FB6K85bgxvkKnBT6kkpy9Gx4HP8c9B75vcBE+Zd7DvStsVT1daZI+vaFqvmlCKj3w52O9SPa9PW9lh721mVy99EnovRxZAT5Sj/w8Hz95PcwQCL5sHRS+tkGxvZKnQ77ajFK+QKQovtCmqT3FMWc9+AbxPaeJHj5qa+W8hf1nvb7icj7G5ZM+aS7cvSvPZTxgLzm+xhXCPgOLWj5mYJo94y0hvXI0w70FRYS95IUwPpn8Kz6f+PY9XKJSPiU3FD4vVZ09IddpPdNCxD2F6Zc+NvUuPjg6p7zaZgQ+0CMovr/2BT4wgAo+Pzt7PZgTcb6ZugG+8FQdPu2UlT0VYIe8DQZGPhR2lL4L6ay9qqmvPb66iT6qCNO8U91ZvOod1j3zHZk8G1eJvtmYVz3Pusc9NypgvquXub3pocW8emJAPUsoX74QcuE87aD5PIdVLzzoN3w9fLPDvdF0FbyLN+67mR6xvYxWOL7VH4S9FnaBPaUin72Fh9W9bqV2vAy2qj0PSsA9wRbGPVx2Rb0mvF4+f7GIPMmEaz7QpKK+VkwHPhwSwr1ipRu+VaiGvUgnSb6Dvl49CQnmPWj5y7wFu0s9fi08vhZaP72DQjC+jpp1vdV5YrxN0Q6+rEE5vXgmK76kcSO9A7MqvkDz5r7rNBe9FcT9PU/lqL1ItdK86623vXqpkz6xQLo+2wyEPdeybj53Zbe+9+c1PuI4Kj4daiM+HwAPvgthljzAX749h2UqvhR4Br69TEi+mvRLPlvL2L0zEU0+WWstvjHnt71GcZY+ElJBPqXsuT1oIKU+AFk+PqroQL5iLqu9aYXavVIKOz5saVQ9dqF1PQNpnr7q5p8+z2aePmjzRjzdbyG9CQ8kPQjoKb714zE+OmC4Ozphsz31ZCw+DTGGPaWDwb3Z6ae+n5xIPthKxD28nYM84Pm3PRCnu75Kame+9RLMvjr+NT2Ml/s861o9PmJQQj7KLfW9uWuSPvcR9rstX8K+yzxMPq0I/b0BByW8Y6O8Ox3d2b0pCXQ+dMOkPksH/z65PwA9hQQsvgPkRD1gCJa9Mz5cvuf2Ej3+1wG94sNrPm1Lyj3fXTU86undva3Dor7XsQ++IlslvvlBdb7nzdO+yCqzPmJ/hDwPeUU8pWctPiC2Lj7VtaY9eHIFvPwSF717AC4+Sagcvj2BPjuQk1++mPukPqCbET7tZAM9UFEVPnAyrz4RPAY/UDoGPqXxzz3zsr47m8+SPrVyP75VWGM9O/0pvsbloj7Juas96ZLpva/SXD4/5JC9aqT3PWoAFL7hMR28lKjEPSrH0r3l7xU+E1WXPoBgrD6b6jm+CagBvLdpaD6ktyW+OGFVPo/Eqj3+4gO+mDFlPO4/zT3kkE0+MWDYuY+WD77QITC9odMivsjpkj27afa9UEQwviKtTr4Syu88CiUVPrnQwb00SkW96nY0vsdUFz7IzbC9h4RRvq77/j0gVt49jZkbvTUexr3/FQG+G33fPfm55z0mOIy9A/kQvZuRkb1lskO92cOvO59p/LzfunU7HQWbPmmqiD56rcy8k34yPvkyar7s240+PkMAPj6IOL78xLC9Y5ZxPu7oLj5UM+E6D2k2vslFRz4pVwG+Eisnvim8mL6CaIm99cYluyFNrz7Jj6o9BtVivUjXWj7w9f89SN/GPSoLIz6ua7i9nvWGvVAUV77+VQc+M4F0veogiL3iIYM8cX8HvkO3yj3AIp8+reEqPiz7KD10nZM9zKmSPrRgZr2oZSy+Zh0gvskqhTy+wII9QfcqvXv0JD5ecDm+5AuCPkGUwj0sqZ++/mz/vc7r2b2+oos+CoS1PoUf/731E2w+p0vDPVG+Lz6bMIc9iMKKPM09dz3KcEE9637OPZpnQT7AjQs++WaZvjMxqL7G/o89foWTPQZNjj7o24S9I4B4vnyguz6oxYM+diEXvSjyMr6u6lQ+dS34uyUg0D3pj7u9XPScPdRhID3Khly9T21uvumFxTxcCYC+f8a+PO84Br7g6TY+OiLHPS9b9L2vkyw+zPBuPoeKWT7S/VK+ZW+QvW0qg724+CK+zS2GPvqx/j10CFw+Myq0vtkNzD18f5O9dBYhvgS5kz2ARGo+mYCxPZbIC76dxic+jm7svXGajD2RgPW+0QaavjmXvL6T5jW8JNexPrWNzr3e2ie8oH/8PZ7kM74kE/Y+BUdsviomsD01KjU+htQwPuUrSb5ovkm+7SZ0PToYM72P9D8+TG/1PdJ5lD6mjby+NO/RvKjL9D3Qyje+j2sfPu2twT6nv4m+WD5Rva9w/j3rMRS8gKOGPWO8Yb2WXqq9S7DYvQDYAb3lEIU+tDUPvEHcmD7Z1Q8+IidIvnk+Oj7+MwK9Sz4ePjYsyT20Bpi6TjyjPXExWT6FHs4+wVaDvQY/Fr41I/G9T94NvdJGGLwursY8610rPsI40L5L+xy++CKPvjEfjjxCi1g9sukjPtUElL2o4hm+13Z/PYpdt71GgiS8pzVRPfbfpz6C+9U9HZMEvnfoCr4nwm6++1AbPeU4jr1KrCw+pTh/vWSfmj3Z6zQ+rcFyvL/H0D1R0YY+iynyvnKXcr4KG0c+TMwbvcQ2lz7jgaC+p6K0vv3hnL36OX6+i1IBvmxYdr3esS++vFRTvhbZS74t2kS+TkFmvosL5r2kzJ69AbicPXngsz1RXiS9H4thPpx8gz1Fc7S8k9ZKvXjVbz6nzjA+BYGMvSwRljzquxy+EXdBPtPekbvOzS++cDcxvVjwJD2R9wc9d9rPPap1+rwxjf49l63IPZNp6rvjTqO+ttIVPWjSoz5crCI+uB+jvUML5DyM7F2+2n6LPia+lL2/Adc8pCF0vQXROr7Ivh++CXNWvefXGj4T/uy8gp8mPOlkID7acQC9VaNwvsTSBz5IjaA+p5vavUB+Gb4s2iu8Hi8EPk0kmL1TEeW9OuoVPUcXiT12qe08Q5mQvmUol76pxLE971jvPsNrNT5YJxu+Byu6PpiABj64jYU+htUwPsKlrL31qAw+Ki3Uve8TqT7B3QI+3B0LvY8KYL0Imn490cdFvlSpkr39MII9EvEKPq1ulr4gqAu+9zKXvOOgAz8jZeS+W6tRvkhjIz69Qs09diWxPuKOSz7imwu+U5HPvevre76gs0i+9l8zOfck7j0kHXu+PklFvEoB4z3Of6q9msMNPjMMfr7CyNc+rifxve/9sz6tGtY+OIGgPptnJr506WS9oT+RO2DETr1+noW++bqcPi0NpzzOzG4+4bjUPFRwRD4o/DA+IOgXPRrwCT7EsUU+uWSrPvsvlT6Spg2+80wJvouVM74GJ1o+yDMXPUDKjz6XVSo+rsJyPWwTxb1Dtlu882bVPZcUlz2q6Oq9Bi5JvdDFOD42CsA9+dKcPP6auz7WZIw+uJdMPmoT9725FmQ+z1zAvj9ckj6ov48+ILv1vo3mxr4kWbY9CmzwvU8/lL1IMQE+3xyrPdWKj7yI0vS9zp7GvtUHiL7UqT8+kLTwvVi22j7kdAM/IBEOvpZgWj5Qsg6/2lfTPhJvuz0hBSG+V3JJPlXHGj/SjHY86Gi5vdziOz1GxdA+SmmQvjLUGj40hcQ9ztPNPA2aJj7xoSa+QaEDvnunzL2S7pw9mzxxvq2RJrtpK5i9ck5fvrPPkz5VWWg+QVOrve/4Cj17BBC+H3rdPciUHr2egtQ7vhXkPZCD0zuUw1I+vFQkvZYVfz7gALU+JivSPnVNNz7iCA2+zOG8Pb/zGD08OoA9xrAYvdN6GD3sFyc8qsERvpHdPD46o4i8sH7OPOQs8z0xJSG+lZgWv3B0Fz7D4Ya6bnY4PsBhST7FkA48CoKWvA9FnD7o2xK+EKrcvsi+Oz5CY8w7cJ7pPWcIrT2EWXk+42OtvqXBWzxa1Ku+bw91vTjGd75z7hY+7iiOvmzZuL06wGQ9T/LqPbIy0b6gQAQ9q33vvA9TzDs+nBY+l16xPQQC/bzXi50+NxUyPREDXb5kWms9oq55vYhsszyTX6c+F/jTvf5Kxb1t/Ae9ukfHPriBVL3OhLU9vfLiPTPiIjxavZA9+p1KvbyXTj7FHD6+zkgPPnPWYL3tj40+89CqvQf6F7xl+Pc9i/Qsvn8AhT7ideM90GpDvuyejD6lvG476V22vuRfg76bwe095G/5PQRtwD3rzqI8iAAkPVf4gj4JGBg97NGpvapFXL00g6m+bFQqvfwDmT5OWHK8nMyAvfyuwb4MD5I+cs0HPXBn2DzUPpq9DMkvPaURGD1INWm9yg7GPgWDZ74+XNi+5ziPPOvckD6zmp0+zNM1PnmqBj67g1s9HbewPj2AVb5LVdg9zx2HvbX90TyiqIY+vh/yvJmDiz4WJ1e+JFrLvVvvlL072DS+WkwZPpg5KzztC4C9UHgkPfLZlL7BxL09clabvuARBb7P9FO9O9PEvlesvz5jqNa+9cqivo2wmD64tNG+FAIxvGU7nj2oHGS+mbunPsNM5b29oWk+N1ktPq4A673XpEo+UyTcPOQkHL7ZkKM+lR76vEVTc75Xphs+/4MPPqoCPztypju+xYCdPQFmLr4oZAu+9uNnvgcVND1MLYK9v7IqvnjgEb55Ilk9lZXyPXE6HT59Hdg+fNWivPh3LT1FKWE9MkyvPUDgyrztCm+8fUU5uzmhATyBuxo9sqcQvaEVjzwR+i496D8/PQAAAABPEFo7MEtNPZp+ZDsDxyq8CaarPJsTv7s61eY8AAAAAJkyuDy4M9A8gbOuPYdp0zzOJd88QgQAPcktcz0vdFg8SydsPcjUObyzY4k9AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA7BXyvA9Hnr5ImUY+4/3GPsAjhz4lmZk+JGGcvjilqr6Od449DI2OPd3YFL9+meg+jBPAvoqn5j42wgk+jvM1PuzOoj79awS+UtC7vqV8BT7QJrO+icrDPthPd75YaMk+M3cevpqYSz6H47a+MezMPgPe9z2SQiC+bOkUP1EakD3Nt7C8jZ0yvw4fnz7qMBc/1go5Poh/xz0t3sO++0Utvw7o0b7F0gM+4+HVPpN2Hj/qnHQ++TZpvuGwJD/2TA+/HGJ1vmSOi769wiW9oTvDPiGl4b65ds4+M3UUv7GiDr9Xzyq/g1WDviC4A78dtQK/BHhXv+6T+T4TgeO+8OlVPTemG7+glxK9AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAADB"
  }
}
